{"rating": 7.6, "genres": ["comedy", "crime"], "description": "In London, George Thomason, his seductive American girlfriend Wanda Gershwitz, and their associate Ken Pile are planning their latest crime, a diamond heist that should net them £13 million. They plan on leaving the country with the goods after the heist. On Wanda's recommendation, they enlist the help of her brother, Otto, a weapons expert, for this heist. In reality, Otto is not Wanda's brother, but her latest lover, a dimwit who gets off on his own body odor, who believes he's an intellectual because he reads Nietzsche, and who does not tolerate being called stupid by anyone. Wanda has one weakness in men which is how Otto was able to get her to be his lover: speaking Italian in seduction. Wanda and Otto plan to double cross George by having him arrested for the heist, while they abscond with the jewels. Wanda further plans to triple cross Otto by eliminating him from the picture after she has the jewels. They are able to get George arrested with him not knowing who tipped the ...                Written byHuggo", "certificate": null, "title": "A Fish Called Wanda", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5OTIzODI4Nl5BMl5BanBnXkFtZTcwNDg3NzYzNA@@._V1_UX182_CR0,0,182,268_AL_.jpg", "youtube_id": "dqAJUlSRCwo", "cast": ["John Cleese", "Jamie Lee Curtis", "Kevin Kline", "Michael Palin", "Maria Aitken", "Tom Georgeson", "Patricia Hayes", "Geoffrey Palmer", "Cynthia Cleese", "Mark Elwes", "Neville Phillips", "Peter Jonfield", "Ken Campbell", "Al Ashton", "Roger Hume"], "released": "1988-08-05", "directors": [], "writers": [], "year": null, "duration": "1h 48min", "type": "title", "id": "tt0095159", "review": {"text": "Before I review this film, I want to mention that I've seen it about ten times and have yet to stop laughing at any of the jokes. This is one of the best written and acted comedies that I've ever seen. The plot is airtight, and the jokes are perfectly timed and delivered. This is due in large part to the spectacular cast of the film. Jamie Lee Curtis, Johh Cleese, Michael Palin, and my personal favorite Kevin Kline as Otto the moronic ex-CIA agent who's too stupid to realize that he's stupid. The film centers around the four aforementioned actors who are involved in a bank robbery, and the conniving and backstabbing by each that takes place afterwards. A large portion of the comedic material in this film comes from the mixture, or more precisely clash, of British and American cultures. Kevin Kline's portrayal of Otto the red-blooded American with entirely too much ego and confidence is contrasted perfectly by John Cleese's reserved and in Otto's words &quot;sexually repressed&quot; English gentleman who is too scared to go out and live his life. Jamie Lee Curtis is also great as the title character who is determined to back-stab and cross anyone and everyone in order to get what she wants. Finally, there's Michael Palin as Ken the hit-man/animal lover/severe stutterer who must kill a key witness in order to protect his boss. If there are any funnier scenes than the ones where Ken must kill this witness, I haven't seen them. Palin is absolutely brilliant, easily one of the best comedic performances ever. The film is close to 2 hours long, but the plot is so clever and well structured that it's over before you know it. To me, that is one of the trademarks of a great film. You don't want this movie to end, and you're disappointed when it does. Do yourself a favor and watch A Fish Called Wanda and you will wonder why you haven't seen (or in many cases even heard of) this film before.", "rating": "10/10"}}