{"rating": 6.7, "genres": ["comedy", "drama", "fantasy", "romance"], "description": "Harris K Telemacher is a 'wacky weekend weatherman' for a local Los Angeles television station who is searching for meaning in his otherwise cliche ridden Los Angeles life. With the help of an insightful and talkative Freeway sign, Harris embarks on a journey through Los Angeles in pursuit of Sarah, an English reporter who has been sent to the City of Angels to research an article for the London Times.                Written byTheMovieHippo", "certificate": null, "title": "L.A. Story", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDU3NDA1OV5BMl5BanBnXkFtZTYwOTQzNzI5._V1_UY268_CR3,0,182,268_AL_.jpg", "youtube_id": "0eCSmfP4g2c", "cast": ["Steve Martin", "Victoria Tennant", "Richard E. Grant", "Marilu Henner", "Sarah Jessica Parker", "Susan Forristal", "Kevin Pollak", "Sam McMurray", "Patrick Stewart", "Andrew Amador", "Gail Grate", "Eddie De Harp", "M.C. Shan", "Frances Fisher", "Iman"], "released": "1991-02-08", "directors": [], "writers": [], "year": null, "duration": "1h 35min", "type": "title", "id": "tt0102250", "review": {"text": "LA Story is a funny and very inventive comedy drama, even though the real love affair is with LA itself. When looking at the storyline, it does look a bit odd, (man receiving love advice from a freeway sign?) but this helps give it a more surreal and somewhat magical edge. The acting is very good all across the board, even from a non-man-eating Sarah Jessica Parker. It has a lot of quotable dialogue, (she's not young she'll be 27 in 4 years) and some passable cameos from Rick Moranis, Patrick Stewart and Chevy Chase. Perhaps some scenes get a bit too sentimental and make the film seem a bit uneven. But I think this helps improve the shape of its overall atmosphere, and make it heart-warming and not just a bit of gas. LA Story is an underrated classic. It's consistently enjoyable, nicely acted and highly memorable. 7.5 out of 10.", "rating": "10/10"}}