{"rating": 7.5, "genres": ["action", "crime", "drama", "thriller"], "description": "A hitman who lives by the code of the samurai, works for the mafia and finds himself in their crosshairs when his recent job doesn't go according to plan. Now he must find a way to defend himself and his honor while retaining the code he lives by.                Written byScott Jarreau", "certificate": "", "title": "Ghost Dog: The Way of the Samurai", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BZWQxZTJmN2YtMjdmMS00ZTFmLTk5ZDYtODA4ZDA1YWQ2MjMyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_UX182_CR0,0,182,268_AL_.jpg", "youtube_id": "Rml5ehAl7SM", "cast": ["Forest Whitaker", "John Tormey", "Cliff Gorman", "Dennis Liu", "Frank Minucci", "Richard Portnow", "Tricia Vessey", "Henry Silva", "Gene Ruffini", "Frank Adonis", "Victor Argo", "Damon Whitaker", "Kenny Guay", "Vince Viverito", "Gano Grills"], "released": "1999-10-06", "directors": [], "writers": [], "year": null, "duration": "1h 56min", "type": "title", "id": "tt0165798", "review": {"text": "Jim Jarmusch is one of the few filmmakers in Hollywood able to make bodies of work that are challenging, thoughtful, and with a distinctive voice. Like the Coen Brothers, it&#39;s hard to make his films accessible to the public like many other films at the cineplexes, and that&#39;s part of the joy in watching a film such as Ghost Dog. It&#39;s such a strange kind of story, but it&#39;s a story that extremely well crafted, even when some of the characters aren&#39;t developed enough past a certain point. While I can&#39;t really say that it&#39;s a great film, there are plenty of great things about it.Such as a pulsing, rhythmically engaging soundtrack (I&#39;m not a big fan of rap and hip-hop, but the artists on here are better than expected) with the RZA behind the seat. Delicate, finite cinematography by Robby Mueller (who&#39;s other superb collaboration with Jarmusch was on Down By Law). A performance from Forrest Whitaker, as the dedicated, un-hinged-from reality &#39;samurai&#39; known as Ghost Dog, which ranks among his best and shows in plain sight that he can carry an action film with patience and cool. And the film also carries a fine sense of humor to many scenes - the fact that these gangsters (one of which Dog&#39;s boss) watch more cartoons than take care of business is as funny as the way they interact sometimes. While it tends to streak on parody, in the characters there&#39;s still the fascinating Jarmusch has in mixing the cultures. It&#39;s a hard film to classify, for even though it&#39;s a martial-arts movie, the only sight of a sword is used for practice and not a blood-bath in Kill Bill. It&#39;s a gangster movie, but every five minutes or so there&#39;s philosophical notes on the way of the samurai that seems more in place in a (good, thematically engaging) art film than a (good, shoot-em-up) Hollywood actioner. It&#39;s a movie about urban-life, yet the only signs of Urbana are shown from a distance, where the only two who will talk to Ghost Dog are a Haitian ice cream guy (who provides a wonderfully weird scene on the roof with Ghost Dog), and a little girl who likes to read. But it&#39;s this mixture that can keep a viewer on his or her toes, especially once you realize the psychological state of the lead as much as his spiritual state.Parts of the film might turn off one group, but the other parts of the film might keep the same group enthralled. In fact, it&#39;s as interesting a comparison to be made to Kill Bill (itself a hybrid) as it is in the spiritual and stylistic parent, Le Samourai by Melville. Like those films, at the least, Jarmusch&#39;s film asks to be looked at more than once...Anyway, three cheers for Garry &quot;Nobody&quot; Farmer!", "rating": "9/10"}}