{"rating": 6.5, "genres": ["crime", "thriller"], "description": "Kemal Kayankaya, a private detective, was hired by a Turkish women, Ilter, to search for his husband, Amend, who has been missing since the death of her father, Vassif. Unknownst to him, he was about to unravel the secrets of his client's family, as well as their various dealings with the underworld and the police. Moreover, being a Turk raised in a German foster family, he has also begun to understand and accept his own ethnicity.                Written byEdward Chan &lt;edward@panda.uwaterloo.ca&gt;", "certificate": null, "title": "Happy Birthday, Türke!", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjA1ODExMV5BMl5BanBnXkFtZTcwODAwODAwMQ@@._V1_UX182_CR0,0,182,268_AL_.jpg", "year": null, "review": {"text": "Wow! When I first saw this movie I was quite impressed because of its combination of realism on the one hand and satirical elements on the other. The film is first of all an allusion to private investigative characters like Philip Marlowe. It ironices not only its predecessors in that genre but also the way the turkish people in Germany have been shown in german cinema before -- Kemal Kayankaya, the main character, is a turk who can not speak turkish, because his parents died when he was a little infant. Afterwards he grew up with german parents. So all the prejudices against the turks he has to face seem ridiculous to the audience. Doris Doerrie, the director and writer of &quot;Happy Birthday, Tuerke!&quot; lets you gain a rather realistic glance at the situation of the turkish &quot;Gastarbeiter&quot; without treating them as a poor and abused minority and victims.", "rating": "9/10"}, "cast": ["Hansa Czypionka", "Özay Fecht", "Meret Becker", "Doris Kunstmann", "Lambert Hamel", "Joachim Król", "Nina Petri", "Christian Schneller", "Ömer Simsek", "Ulrich Wesselmann", "Richard Beek", "Emin Boztepe", "Siir Eloglu", "Ben Engel", "Dagmar Franz"], "directors": [], "writers": [], "youtube_id": "9WzV1XacAgY", "duration": "1h 49min", "type": "title", "id": "tt0102000", "released": "1992-01-09"}