{"rating": 7, "genres": ["comedy"], "description": "The young policeman Koeppe just left the academy and is transferred to a small police station in the countryside. He's a merry guy and dreams of a career, however he's not very bright. A brutal cow slayer keeps the local police perplexed. In his spare time Koeppe is struggling with his approaches towards the rich Annelie.                Written byTom Zoerner &lt;Tom.Zoerner@informatik.uni-erlangen.de&gt;", "certificate": null, "title": "Karniggels", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BNjM2MTk4MDk3Ml5BMl5BanBnXkFtZTgwMzc0NTAzMTE@._V1_UY268_CR3,0,182,268_AL_.jpg", "youtube_id": "BxV2VweSfFE", "cast": ["Bodo Abel", "Axel Altmann", "Willy Bartelsen", "Marianne Bernhardt", "Brigitte Böttrich", "Jutta Bryde", "Herbert Buck", "Inga Busch", "Dagmar Cassens", "Sven Dahlke", "Karl Knieser", "Edda Pastor", "Michaela Freund", "Michael Fuchs", "Peter Groß"], "released": "1991-11-14", "directors": [], "writers": [], "year": null, "duration": "1h 34min", "type": "title", "id": "tt0102190", "review": {"text": "Who remembers &quot;Northern Exposure&quot; the television series about hapless Dr. Fleischman stranded in Alaska whilst dreaming of the big city? This movie here is the German movie equivalent to this series.A young policemen's (played by a brilliant Bernd-Michael Lade) dreams of the big city are squandered when he finds himself stranded in the flatlands of rural northern Germany, where live is boring, the weather is miserable and prospects of evening entertainment are non-existing. Similar to Dr. Fleischman, young K&ouml;pper has to grow up and learn to deal with his situation and his surroundings. Throw in dry northern German humor, a few murdered cows and the typical German attitude towards police and you arrive at one of the best German movies of its time.If you have lived in northern Germany and have experienced the monotony of the landscape and the way of live up there, you will find this movie a real treat; if not, you can still get a good one and a half hours of entertainment out of it. I am waiting for the release of Karniggels on DVD, but considering that northern Germany is not one of the most favorite places and hardly anyone has heard of this film, I am not holding my breath.", "rating": "10/10"}}