{"rating": 7.8, "genres": ["comedy", "mystery", "thriller"], "description": "Ex-detective Brenner wants to keep himself out of trouble but several murder cases and his ex-girlfriend Klara finally get him involved. But making decisions is not one his strengths.                Written byReini Urban &lt;rurban@x-ray.at&gt;", "certificate": null, "title": "Come Sweet Death", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BNWMzZDgwMzYtYzUzNS00YTkxLTgxNDAtNjRkZjBkMmRlZTgyXkEyXkFqcGdeQXVyMTQ2MjQyNDc@._V1_UY268_CR3,0,182,268_AL_.jpg", "youtube_id": "c6_nzPJOlnQ", "cast": ["Josef Hader", "Simon Schwarz", "Barbara Rudnik", "Michael Schönborn", "Bernd Michael Lade", "Nina Proll", "Karl Markovics", "Reinhard Nowak", "Ingrid Burkhard", "Gottfried Breitfuss", "Georg Veitl", "Hermann Scheidleder", "Christian Weinberger", "Trude Ackermann", "Ulli Fessl"], "released": "2000-12-22", "directors": [], "writers": [], "year": null, "duration": "1h 47min", "type": "title", "id": "tt0271029", "review": {"text": "In my comment on &quot;Der &Uuml;berfall&quot; I cheered because I hadn't seen such a creative Austrian movie for some years.Surprise, surprise! Two days before Christmas, &quot;Komm, s&uuml;&szlig;er Tod&quot; opened in our theatres, another film with Josef Hader, but this time they tried something we rarely see in Austrian cinema: a literature film, based on one of the bizarre crime novels from the Brenner series by the young author Wolf Haas. And I didn't believe my eyes: The characters and the language are typically Viennese, but in spite of this the film is suitable for international success! Camera work and editing are professional, there are emotions in the film (which is also rare in Austria), still it's not sentimental, and the cast was so perfectly selected that the unrealistic use of some actors from Germany who were presented as Austrians is not too disturbing. Josef Hader found his star role in the laconic former policeman Brenner who works in one of two competing rescue services in Vienna. Nina Proll and Barbara Rudnik are wonderful but not excessive actresses and Karl Markovics is absolutely present in every single of the few scenes he appears in.I saw the movie with a friend who only said: &quot;Well, it's just a crime film.&quot; Of course, you can't expect any deepnesses; the movie is only cool, entertaining, humorous, gripping (my hands were sweating towards the end) and likeable also for its local colour.Wolfgang Murnberger who is known for rather depressing background descriptions (&quot;Ich gelobe&quot;) could have made a mess out of the material but he took it seriously and so he succeeded. I suppose it was a good idea to let Hader and Haas co-write the script.", "rating": "9/10"}}