{"rating": 6.9, "genres": ["comedy"], "description": "Preston, Idaho's most curious resident, Napoleon Dynamite, lives with his grandma and his 32-year-old brother (who cruises chat rooms for ladies) and works to help his best friend, Pedro, snatch the Student Body President title from mean teen Summer Wheatley.                Written byAnonymous", "certificate": "", "title": "Napoleon Dynamite", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BNjYwNTA3MDIyMl5BMl5BanBnXkFtZTYwMjIxNjA3._V1_UX182_CR0,0,182,268_AL_.jpg", "youtube_id": "ZHDi_AnqwN4", "cast": ["Jon Heder", "Jon Gries", "Aaron Ruell", "Efren Ramirez", "Diedrich Bader", "Tina Majorino", "Sandy Martin", "Haylie Duff", "Trevor Snarr", "Shondrella Avery", "Bracken Johnson", "Carmen Brady", "Ellen Dubin", "J.C. Cunningham", "Jimmy Stevens"], "released": "2004-08-27", "directors": [], "writers": [], "year": null, "duration": "1h 36min", "type": "title", "id": "tt0374900", "review": {"text": "This movie is quite possibly the funniest movie ever. It doesn't have much of a storyline, but in this case, it doesn't matter. I keep reading reviews that say it isn't believable. Anyone who has attended High School in the last 10 years knows that this movie portrays exactly what it is like. Who doesn't know someone exactly like Napoleon? Or Pedro? Or Summer? Or Deb? Or Don? There are Napoleons, Pedros, Summers, Debs, and Dons in EVERY American High School. One of the funniest parts about this movie is that it IS so accurate. And who hasn't run across an internet geek like Kip? This movie is filled with jokes about our culture today. I haven't met one person yet who has seen it and not liked it. Talk about a cult classic in the making. The film uses witty humor, and a little goofy humor. It's the PERFECT film for light comedy. If you're into those kind of films that make you think a lot, this one definitely isn't for you. On the other hand, if you laugh at things like Napoleon getting psyched for a milk-testing contest, or lying about hunting wolverines in Alaska, exaggerating about his bow staff skills or his brother bragging about chatting online with &quot;babes&quot; all day, you can't go wrong. (10/10)", "rating": "10/10"}}