{"rating": 7.3, "genres": ["comedy", "drama"], "description": "In post war Sweden it was discovered that every year, an average housewife walks the equivalent number of miles as the distance between Stockholm and Congo, while preparing her family meals. So the Home Research Institute sent out eighteen observers to a rural district of Norway to map out the kitchen routines of single men. The researchers were on twenty-four-hour call, and sat in special strategically placed chairs in each kitchen. Furthermore, under no circumstances were the researchers to be spoken to, or included in the kitchen activities.                Written bySujit R. Varma", "certificate": "", "title": "Kitchen Stories", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNjEwNTc5MV5BMl5BanBnXkFtZTcwNzE3MjcyMQ@@._V1_UY268_CR7,0,182,268_AL_.jpg", "youtube_id": "sKYyHJFxmVA", "cast": ["Joachim Calmeyer", "Tomas Norström", "Bjørn Floberg", "Reine Brynolfsson", "Sverre Anker Ousdal", "Leif Andrée", "Gard B. Eidsvold", "Lennart Jähkel", "Trond Brænne", "Bjørn Jenseg", "Jan Gunnar Røise", "Karin Lunden", "Päivi Laakso"], "released": "2003-01-17", "directors": [], "writers": [], "year": null, "duration": "1h 35min", "type": "title", "id": "tt0323872", "review": {"text": "The only lamentable part of this extraordinarily moving film is its title. I went to an art-house cinema in Toulouse to see it, more for Hamer's reputation than the published blurb, still not knowing what to expect. Nothing moves in the film, like the observant Folke on his directorial high chair, we are watching the goings on, monotonous.  But, boring? Most certainly not!  As the plot develops around the friendship between the subject and the object, we are drawn into a conflict which is essentially outside the boundaries of nations: how can you understand someone without verbal communication, for the sake of scientific research?  You can't. Bureaucratic strictures can lead to disobedience however much the personal cost of that kind of action might be.  Folke and Isak forge a friendship in a relatively short time, which might take others years of nurturing.  We applaud the rebellious scientist when he dumps his snail-shell caravan to return to Isak's uncomplicated rural dwelling. The most moving closing scene suddenly makes you realise that what seemed to be a static film was, in fact, full of heroic action. That there are only two IMDb comments on this film demonstrates how exclusionist South Europe and the States are, when third rate trash receives attention of one sort or the other.", "rating": "10/10"}}