{"rating": 7.7, "genres": ["drama", "romance", "thriller"], "description": "From a humble background and with traditional values, Irish Chris Wilton is still struggling financially despite being a recently retired high ranked tennis pro. He has taken a job as a tennis instructor at an upscale London tennis club, although he knows there is a better life for him somewhere down the road. He is befriended by one of his students, wealthy Tom Hewett. Chris starts to date Tom's sister, Chloe Hewett, a girl-next-door type who is immediately attracted to Chris. Chloe quickly knows she wants to marry Chris, and through her businessman father, Alec Hewett, tries to help Chris and their future by getting him an executive job in Alec's company. In his life with the Hewetts, Chris begins to enjoy the finer things in life. Through it all however, Chris cannot help thinking about Nola Rice, a struggling American actress who he meets at the Hewett estate and who is Tom's unofficial fiancée. Nola is vivacious, and she knows the effect she has on men, including Chris. Unlike ...                Written byHuggo", "certificate": "", "title": "Match Point", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzY4MzE5NF5BMl5BanBnXkFtZTcwMzQ1MDMzMQ@@._V1_UY268_CR3,0,182,268_AL_.jpg", "youtube_id": "wISRAOb6xm0", "cast": ["Jonathan Rhys Meyers", "Alexander Armstrong", "Paul Kaye", "Matthew Goode", "Brian Cox", "Penelope Wilton", "Emily Mortimer", "Janis Kelly", "Alan Oke", "Mark Gatiss", "Scarlett Johansson", "Philip Mansfield", "Simon Kunz", "Geoffrey Streatfeild", "Mary Hegarty"], "released": "2006-01-06", "directors": [], "writers": [], "year": null, "duration": "1h 59min", "type": "title", "id": "tt0416320", "review": {"text": "What a throughly engrossing evening Woody Allen has provided. This film has been, by and large, poorly received by the British critics. I cannot understand why. Yes, it does have the strongest echoes of Crimes and Misdemeanours, but if a director/writer can't borrow from his own product, who can? This isn't funny Allen -- there are few laughs -- but it is an extremely intense and successful serious Allen.Does Allen's magic transfer to my home city? You bet it does; lovely locations; Notting Hill, the Tate Modern, the &quot;Gherkin&quot; in the City, all look great but are also entirely relevant. Many critics said he didn't have an ear for British dialogue. I simply don't hear that -- it may be a bit stagy at times, but the writing is spare, to the point, and literate. Few trans-Atlantic clunkers.Yes, there are some silly bits; bits where you wish any half-intelligent Englishman had watched the film and said &quot;Wood, old son, this is cobblers&quot;. British detectives don't call themselves &quot;Detective so-and-so&quot;. They might be Detective-Sergeant or whatever. The force that polices London is the Metropolitan Police, not the &quot;London Police&quot;. Perhaps Allen didn't realise that his main copper, Ulster actor James Nesbitt, sounds a parody of the amusing roles he plays in some widely-seen British Yellow Pages adverts. Little things, so easy to iron out, that detract just a touch from credibility.Scarlett Johannsson -- what an actress, is she really only 20 or whatever? She packs huge power and stunning looks, if occasionally getting a trifle near Glenn Close in Fatal Attraction. Jonathan Rhys Myers does his forlorn sports coach bit, as from Bend It Like Beckham. The solidly Brit supporting cast is entirely believable, even if their effortlessly affluent lifestyle takes a bit of swallowing. Genuine surprises at the end. This is a thoroughly satisfying evening at the movies.", "rating": "9/10"}}