{"rating": 7.4, "genres": ["drama"], "description": "On the lonely roads of Winston-Salem, North Carolina, two men forge an improbable friendship that will change both of their lives forever. Solo is a Senegalese cab driver working to provide a better life for his young family. William is a tough Southern good ol' boy with a lifetime of regrets. One man's American dream is just beginning, while the other's is quickly winding down. But despite their differences, both men soon realize they need each other more than either is willing to admit. Through this unlikely but unforgettable friendship, GOODBYE SOLO deftly explores the passing of a generation as well as the rapidly changing face of America.                Written byAnonymous", "certificate": "", "title": "Goodbye Solo", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MDQyODE4MTJeQTJeQWpwZ15BbWU3MDcxNjM1MjI@._V1_UX182_CR0,0,182,268_AL_.jpg", "youtube_id": "U5IGC59Q9y8", "cast": ["Souleymane Sy Savane", "Red West", "Diana Franco Galindo", "Lane 'Roc' Williams", "Mamadou Lam", "Carmen Leyva", "Peter N. Anyieth", "Jim Babel", "Sarah S. Brooks", "Lasheka Brown", "Todd Davis", "Alexandra Dimopoulos", "Neill Fleeman", "Jamill 'Peaches' Fowler", "Evelia Garcia"], "released": "2009-08-26", "directors": [], "writers": [], "year": null, "duration": "1h 31min", "type": "title", "id": "tt1095442", "review": {"text": "&#x22;The basis of optimism is sheer terror.&#x22; Oscar WildeThe two improbable &#x22;travelers&#x22; in Patrice Leconte&#x27;s Man on the Train seem like old men at a nursing home compared to the dynamic layers of regret and hope between Senegalese cab driver Solo (Souleymane Sy Savane) and grizzled old man William (Red West)in Goodbye Solo. Solo takes him on several rides in Winston-Salem, North Carolina, culminating in a life-changing one in the Smokey Mountains. This tense little drama of ordinary people has a distant relationship to Beckett and Pinter, whose dramas introduce unknown forces and people who change things, even if those elements don&#x27;t appear. Iranian director/writer Ramin Bahrani, along with co-writer Bahareh Azimi, has neatly shown the quotidian events of Solo&#x27;s life, from the joys of a loving step-daughter and new son to strain of trying to become a flight attendant. Upon the entrance of the troubled William into his life, Solo deals with his urge to help William overcome depression and disappointment and Solo&#x27;s own existential uncertainties.Goodbye SOlo has large ambitions about showing the need to understand the end of life for the desperately disappointed and the beginning of a happy life for the positive, optimistic newcomers in the great melting pot. Solo remains hopeful in both arenas despite the forces allied against him, finding strength in his alliance with William just as characters in Beckett and Pinter find theirs.The coda is as impressive as any other this year: the top of one of the North Carolina hills is circumscribed by an eccentric wind that seems to blow up and back at the same time, figuratively signaling the end and beginning. Solo and step-daughter Alex take comfort in the danger of the wind and precipice adjoining the safety of each other.The message is clear&#x97;life goes on, sometimes dangerously, sometimes beautifully.", "rating": null}}