{"rating": 8, "genres": ["action", "sci-fi", "thriller"], "description": "In 1982, a massive star ship bearing a bedraggled alien population, nicknamed \"The Prawns,\" appeared over Johannesburg, South Africa. Twenty-eight years later, the initial welcome by the human population has faded. The refugee camp where the aliens were located has deteriorated into a militarized ghetto called District 9, where they are confined and exploited in squalor. In 2010, the munitions corporation, Multi-National United, is contracted to forcibly evict the population with operative Wikus van der Merwe in charge. In this operation, Wikus is exposed to a strange alien chemical and must rely on the help of his only two new 'Prawn' friends.                Written byKenneth Chisholm (kchishol@rogers.com)", "certificate": "", "title": "District 9", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTI1OTM5NF5BMl5BanBnXkFtZTcwMzk5MTU1Mg@@._V1_UX182_CR0,0,182,268_AL_.jpg", "year": null, "review": {"text": "I attended a preview screening of District 9 last night, and I am in absolute awe of this film and its director Neill Blomkamp.Thanksfully, I knew relatively little about the story going into the film. I had a rough idea of the concept and had seen a few TV spots, but thankfully the film delivered so much more than I was led to expect.What I like most about the film is that it increasingly gains momentum throughout its runtime, starting out as a mockumentary (and thinly veiled social commentary), but then delves into more mainstream thriller territory, before culminating in some thoroughly entertaining action set pieces. If action is your thing, be sure to stick it out through to the latter half of the film. As I was leaving the cinema, I overheard many other patrons saying exactly that... &#x22;I wasn&#x27;t too sure for the first hour, but I&#x27;m glad I stayed&#x22; (personally, I have never walked out of a film at the cinema).That is not to say that the first half is any less impressive. I am a big fan of realism in films such as this, and as such, I really enjoyed the documentary feel. I think the intention was for the entire film to be in the mockumentary style, but for me the style changes and takes on a more mainstream look (albeit hand-held)... which I think is important to know going in. There are also a few areas where it couldn&#x27;t be believed that a documentary crew could still be filming (or even alive). But I think the film is much better for this, and definitely more memorable.If there is one thing that irks me about this film, its that the story moves at an incredible pace... particularly in the earlier scenes in the film, which feel rather rushed, and seemingly at odds with the realistic documentary feel it was going for. Things just seem to happen so quickly, leaving little time to digest the premise and characters. I would love to see a version of the movie that extends the first half to allow a greater look into the reality presented to us.SFX-wise, there are no complaints. There is the odd bit of artificial blurring on some alien movement, but overall we are presented with a very low-key, realistic CGI presentation that could teach Hollywood a thing or two.One other aspect that I must mention is the performance of the lead character. Seeing a film of this caliber that has no recognisable actors, with foreign (to an Aussie!) accents just adds to the authenticity... but Sharlto Copley (in his debut performance) is a revelation and one of the most memorable aspects of the movie.I cannot recommend this movie enough, and the wait until the weekend so I can see this film again is just too long!", "rating": "10/10"}, "cast": ["Sharlto Copley", "Jason Cope", "Nathalie Boltt", "Sylvaine Strike", "Elizabeth Mkandawie", "John Sumner", "William Allen Young", "Greg Melvill-Smith", "Nick Blake", "Morena Busa Sesatsa", "Themba Nkosi", "Mzwandile Nqoba", "Barry Strydom", "Jed Brophy", "Louis Minnaar"], "directors": [], "writers": [], "youtube_id": "DyLUwOcR5pk", "duration": "1h 52min", "type": "title", "id": "tt1136608", "released": "2009-09-18"}