{"rating": 7.7, "genres": ["animation", "adventure", "comedy", "family"], "description": "In a happy suburban neighborhood surrounded by white picket fences with flowering rose bushes, sits a black house with a dead lawn. Unbeknownst to the neighbors, hidden beneath this home is a vast secret hideout. Surrounded by a small army of minions, we discover Gru, planning the biggest heist in the history of the world. He is going to steal the moon. (Yes, the moon!) Gru delights in all things wicked. Armed with his arsenal of shrink rays, freeze rays, and battle-ready vehicles for land and air, he vanquishes all who stand in his way. Until the day he encounters the immense will of three little orphaned girls who look at him and see something that no one else has ever seen: a potential Dad. The world's greatest villain has just met his greatest challenge: three little girls named Margo, Edith and Agnes.                Written byUniversal Pictures", "certificate": "", "title": "Despicable Me", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjY0MTQ0Nl5BMl5BanBnXkFtZTcwMzQ2MTc0Mw@@._V1_UX182_CR0,0,182,268_AL_.jpg", "year": null, "review": {"text": "Despicable Me&#x27;s teasers and trailers seemed to represent a few different movies, and that&#x27;s reflected by the general segregation of comedy styles that the film begins with. At the film&#x27;s start, Gru (Steve Carrell) handles the dark comedy, the trio of orphans get the cutesy comedy, and the minions handle the slapstick. As the film progresses, though, these lines begin to blur, building to a strong emotional finale and a satisfyingly complete tale. (This is one of those rare non-Pixar animated films that doesn&#x27;t seem destined for sequel-dom.)The tale of rival villains isn&#x27;t terribly original. Nor is the idea of a villain having his heart melted by adorable children. But the way Despicable Me blends these two ideas is just fantastic. There&#x27;s humor, action, and heart -- what more could you want from an animated film?Also notable is the way the star-studded voice cast handles their characters. While there are a ton of big names filling out the roster, most of them use accents which render them familiar but not too much so. It&#x27;s a different route than many animated films take, and it&#x27;s refreshing. Julie Andrews and Steve Carrell especially do well at straddling the line between their trademark voices and their characters&#x27; accents. The voice that steals the movie, however, is the adorable Elsie Fisher as Agnes. Almost every line gets either a laugh or an &#x22;Aw...&#x22; (On a related note, I love that the orphan girls are named Edith, Margo, and Agnes. I love old names for young people.)The plot has enough twists and turns to keep things interesting, and the antics of the minions provide a nice side of fun to the proceedings. Also, their reaching contest during the credits is a fun use of 3-D that had the kids in the theater reaching for the screen.Last year was a banner year for animation, and this year seems to be following suit. How to Train Your Dragon amazed, Toy Story 3 is one of the best animated films of all time, and Despicable Me impresses. A very pleasant surprise.", "rating": "9/10"}, "cast": ["Steve Carell", "Jason Segel", "Russell Brand", "Julie Andrews", "Will Arnett", "Kristen Wiig", "Miranda Cosgrove", "Dana Gaier", "Elsie Fisher", "Pierre Coffin", "Chris Renaud", "Jemaine Clement", "Jack McBrayer", "Danny McBride", "Mindy Kaling"], "directors": [], "writers": [], "youtube_id": "sUkZFetWYY0", "duration": "1h 35min", "type": "title", "id": "tt1323594", "released": "2010-10-01"}