{"rating": 7.3, "genres": ["comedy", "crime", "drama"], "description": "Four Lions tells the story of a group of British jihadists who push their abstract dreams of glory to the breaking point. As the wheels fly off, and their competing ideologies clash, what emerges is an emotionally engaging (and entirely plausible) farce. In a storm of razor-sharp verbal jousting and large-scale set pieces, Four Lions is a comic tour de force; it shows that-while terrorism is about ideology-it can also be about idiots.                Written bySundance Film Festival", "certificate": "", "title": "Four Lions", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNDQxNzI0NF5BMl5BanBnXkFtZTcwNDM0NzEwNA@@._V1_UX182_CR0,0,182,268_AL_.jpg", "youtube_id": "yszKc4m-W9U4", "id": "tt1341167", "cast": ["Riz Ahmed", "Arsher Ali", "Nigel Lindsay", "Kayvan Novak", "Adeel Akhtar", "Julia Davis", "Craig Parkinson", "Preeya Kalidas", "Wasim Zakir", "Mohammad Aqil", "Karl Seth", "Waleed Elgadi", "Alex Macqueen", "Shameem Ahmad", "Jonathan Maitland"], "directors": [], "writers": [], "year": null, "duration": "1h 37min", "type": "title", "review": {"text": "Like Charlie Chaplin&#x27;s Hitler, Chris Morris&#x27; &#x27;Four Lions&#x27; shows that no subject can escape comic scrutiny; humour always seems to find the ability to expose the ridiculous in otherwise appalling situations. This satirical black comedy vents its disgust at the pseudo-morality of suicide bombing, whilst managing to portray its terrorists with an affection that allows the audience an unexpected emotional attachment with these supposed figures of violence.The film follows a terrorist cell of blundering, inept, and impossibly stupid would-be suicide bombers on their quest towards martyrdom &#x96; we follow them failing miserably in a Pakistan training camp, trying to run through sheep fields whilst carrying bags of explosives, attaching bombs to crows, all the time creating a chaotic &#x27;blooper&#x27; reel of attempted martyrdom videos. These suicide bombers are not the feared assassins of popular imagination, but absurd and easily led dupes who encourage laughter and ridicule &#x96; and significantly, in the end, pity.The comedy of &#x27;Four Lions&#x27; lies in the power of its bathos: the film reduces the dreaded spectre of suicide bombing to a ludicrous pageant of ineptitude. It&#x27;s a film with fast laughs and dim wit in abundance, an absurd &#x27;How Not-To Guide&#x27; to martyrdom.However, the audience cannot help but feel pity for the characters as their plot reaches its climax. There is a sad inevitability to the group&#x27;s last moments together; despite the horror of what the bombers are planning, the audience has been lulled into sympathising with their situation. The sadness of the film comes with the audience&#x27;s realisation that these characters are regular, likable, funny, naive people &#x96; they are not monsters in themselves, but made monstrous by their susceptibility to absurd, immoral teachings.The lead character Omar&#x27;s interactions with his wife and young son are painful in their twisted depiction of the ideal family unit. At one point Omar (played by Riz Ahmed) tells his son a bedtime story about &#x27;Simba&#x27;s Jihad&#x27;. It is a scene that is touching, funny and uncomfortable all at once, a reflection of our responses to the film as a whole.&#x27;Four Lions&#x27; is provocative in its comic parody of an emotional subject, but there is never any sense that it wishes to be deliberately inflammatory. Instead, the story is told with warmth and sharp humour; it offers us a fine concoction of derision and sympathy, pulling at our affections whilst cutting the terrifying down to the clownish.James Gill ------ Find more reviews, news and previews at www.singleadmission.co.uk", "rating": "7/10"}, "released": "2010-05-07"}