{"rating": 8.6, "genres": ["biography", "comedy", "drama"], "description": "In Paris, the aristocratic and intellectual Philippe is a quadriplegic millionaire who is interviewing candidates for the position of his carer, with his red-haired secretary Magalie. Out of the blue, the rude African Driss cuts the line of candidates and brings a document from the Social Security and asks Phillipe to sign it to prove that he is seeking a job position so he can receive his unemployment benefit. Philippe challenges Driss, offering him a trial period of one month to gain experience helping him. Then Driss can decide whether he would like to stay with him or not. Driss accepts the challenge and moves to the mansion, changing the boring life of Phillipe and his employees.                Written byClaudio Carvalho, Rio de Janeiro, Brazil", "certificate": "", "title": "The Intouchables", "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNDA3MDQwNl5BMl5BanBnXkFtZTcwNTU4Mzc1Nw@@._V1_UX182_CR0,0,182,268_AL_.jpg", "youtube_id": "0V8ZJ_8qARs", "cast": ["François Cluzet", "Omar Sy", "Anne Le Ny", "Audrey Fleurot", "Joséphine de Meaux", "Clotilde Mollet", "Alba Gaïa Kraghede Bellugi", "Cyril Mendy", "Salimata Kamate", "Absa Diatou Toure", "Grégoire Oestermann", "Dominique Daguier", "François Caron", "Christian Ameri", "Thomas Solivérès"], "released": "2011-11-02", "directors": [], "writers": [], "year": null, "duration": "1h 52min", "type": "title", "id": "tt1675434", "review": {"text": "In less than two months, &#x22;Untouchable&#x22; became the second most successful French film by number of spectators, such an event by itself that people went then to see it, not because they thought it was good but to see what was so good in it: that&#x27;s the virtual circle of success. My biggest disappointment in 2011 was with &#x22;The Tree of Life&#x22;, a movie I sincerely wanted to love but couldn&#x27;t, and I left the theater before it ended with a bitter taste of frustration. Proportionally, my greatest positive surprise came with &#x22;Untouchable&#x22; because it was the opposite expectation: I was sure I would dislike it, figuring the movie manipulated viewers through the overused device of the improbable friendship. Why such preconceived negativity? Well, when a young black guy from French suburbs, darkly depicted in Mathieu Kassovitz &#x27;Hate&#x27; and infamous for its occasional riots, befriends a rich quadriplegic, I immediately think of &#x27;good feelings&#x27;, &#x27;mainstream populism&#x27; &#x85; unaware that I apply to myself a cynical judgment that can undermine my very way to enjoy not just this film, but any film. After all, why getting ready for hatred when it&#x27;s so relieving to give the benefit of the doubt and get ready for appreciation? Especially since more than 15 millions of French people, from different ages and backgrounds liked it. So, I saw it &#x85; and loved it.The story of &#x22;Untouchable&#x22; is the kind of unintentional masterpiece that only movies can provide every once in a while, it has no other pretension than to depict a magnificent and inspiring friendship story starting as a simple job. A young man with a Senegalese background, Omar Sy as Driss, only needs a signature to prove that he attended an interview for a live-in carer job. For some strange reason, Paul, the rich man, played by a wonderful Fran&#xE7;ois Cluzet, gives him the job, with a one-month trial period. The reason of this choice is smoothly handled by the script: the film starts with all the job applicants, every one of them unnaturally posing and getting mixed in prepared answers. Then, Driss casually enters, without waiting for his turn or knocking on the door, he&#x27;s got enough problems to deal with, unemployment, an experience in jail, being a pariah for society, and undesirable even in his own family, especially her adoptive aunt. Driss&#x27; attitude pleases Paul, because after his paragliding accident, he can&#x27;t feel his body from neck to toes, and needs caring almost 24 hours per days and 7 days per week, so he really doesn&#x27;t have time for bullshit either. And this is a remarkable aspect in the script written by the two directors Eric Toledano and Olivier Nakache: it doesn&#x27;t waste time cementing the friendship, the two leads rapidly get fond of each other, a feeling illustrated in the poster with both posing with natural smiles. The film shows Omar&#x27;s struggle to learn how &#x27;needy&#x27; Paul is, which provides some priceless comedic moments, but &#x22;Untouchable&#x22; goes immediately to the core, an eye-opening message about the life endured by a handicapped person, making all the wealth in the world pointless and the richness of heart and mind, priceless. Through Driss and Paul&#x27;s interaction, the film explores the real needs of people in life, respect and understanding, acceptance and love. Maybe if it was handled by other directors, it would have been predictable but in &#x22;Untouchable&#x22;, the complicity between the two heroes feels absolutely real. There&#x27;s one scene when Driss shave the bushy beard of Paul,&#x85; well, I won&#x27;t spoil it for you, but the part was a clever mix of realism and comedy because anyone would have done what Driss did at one moment, and that&#x27;s the secret of the film: it feels real.Some movies can work with a good story but they need good performances, in &#x22;Untouchable&#x22;, it&#x27;s almost impossible to determine who carried the film, both Cluzet and Sy were great. And I don&#x27;t get the complaints: why they didn&#x27;t respect the original story where the carer was an Arab, or how they &#x27;sugarcoated&#x27; the handicap? I even heard that in America, they were accusing the film of racism because Driss was portrayed as a sort of (I quote) &#x27;helper monkey&#x27;? Seriously, this is getting old &#x85;The way handicap is approached never flirts with an exaggerated pathos, nor the opposite, which is the most intelligent achievement. There&#x27;s a sort of heart&#x27;s intelligence in the way Omar teases Cluzet with his own handicap, and the film provides the extraordinary message that pleasure and thrills have unlimited media, whether they come from pot, an ear-massage or even paragliding. Many of Paul&#x27;s friends criticizes the presence of Driss in Paul&#x27;s life, but Paul doesn&#x27;t care: Omar is a man full of life, big, tall and strong, and when he uses violence to teach a man the respect of a parking sign, Paul admits this is the right method. Both are in the same wavelength. I wondered if the title &#x22;Untouchable&#x22; referred to the lowest caste in India, echoing the two men&#x27;s conditions, both outcasts physically and socially, but I guess, their relationship evolves into a friendship precisely because they&#x27;re both strong-minded, and together, they become even stronger, until getting untouchables ... in the noblest meaning of the word.There are real people in &#x22;Untouchable&#x22;, nothing works as plot devices even if some situations are so cinematically appealing: Omar inviting everybody to dance during Paul&#x27;s birthday, his learning of the aristocratic world, the art of abstract painting, and the way he breaks the conventions with an unconventional charisma reaches a level of energetic comedy that reminds of the greatest days of Eddie Murphy, with Cluzet as a perfect straight-man not deprived from a sense of humor. &#x22;Untouchable&#x22; is simply an inspiring story of friendship with whatever defines this beautiful virtue. And yes, it&#x27;s one of the best French films ever, and certainly one of the best of 2011.", "rating": "10/10"}}